; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj2 - airport
	obj1 obj3 - city
	obj4 obj5 obj7 - truck
	obj6 - location
	obj8 obj10 obj11 obj12 obj13 obj14 obj15 obj16 - package
	obj9 - airplane
)

(:init
	(at obj16 obj6)
	(in-city obj0 obj1)
	(at obj12 obj6)
	(at obj5 obj0)
	(at obj13 obj6)
	(at obj11 obj6)
	(at obj7 obj6)
	(at obj8 obj6)
	(at obj14 obj2)
	(at obj9 obj0)
	(at obj10 obj0)
	(at obj15 obj6)
	(in-city obj2 obj3)
	(in-city obj6 obj1)
	(at obj4 obj2)
)

(:goal (and
	(at obj12 obj2)
	(at obj8 obj2)
	(at obj11 obj2)
	(at obj15 obj2)
	(at obj14 obj0)
	(at obj16 obj2)
	(at obj13 obj2)
	(at obj10 obj6)
))
)

; plan
1. (load obj7 obj8 obj6)
   deleted: (at obj8 obj6)
   added: (in obj8 obj7)
   goals met: 0 of 8
2. (load obj7 obj16 obj6)
   deleted: (at obj16 obj6)
   added: (in obj16 obj7)
   goals met: 0 of 8
3. (load obj7 obj15 obj6)
   deleted: (at obj15 obj6)
   added: (in obj15 obj7)
   goals met: 0 of 8
4. (load obj7 obj13 obj6)
   deleted: (at obj13 obj6)
   added: (in obj13 obj7)
   goals met: 0 of 8
5. (load obj7 obj12 obj6)
   deleted: (at obj12 obj6)
   added: (in obj12 obj7)
   goals met: 0 of 8
6. (load obj7 obj11 obj6)
   deleted: (at obj11 obj6)
   added: (in obj11 obj7)
   goals met: 0 of 8
7. (drive obj7 obj6 obj0)
   deleted: (at obj7 obj6)
   added: (at obj7 obj0)
   goals met: 0 of 8
8. (unload obj7 obj8 obj0)
   deleted: (in obj8 obj7)
   added: (at obj8 obj0)
   goals met: 0 of 8
9. (load obj9 obj8 obj0)
   deleted: (at obj8 obj0)
   added: (in obj8 obj9)
   goals met: 0 of 8
10. (unload obj7 obj16 obj0)
   deleted: (in obj16 obj7)
   added: (at obj16 obj0)
   goals met: 0 of 8
11. (load obj9 obj16 obj0)
   deleted: (at obj16 obj0)
   added: (in obj16 obj9)
   goals met: 0 of 8
12. (unload obj7 obj15 obj0)
   deleted: (in obj15 obj7)
   added: (at obj15 obj0)
   goals met: 0 of 8
13. (load obj9 obj15 obj0)
   deleted: (at obj15 obj0)
   added: (in obj15 obj9)
   goals met: 0 of 8
14. (unload obj7 obj13 obj0)
   deleted: (in obj13 obj7)
   added: (at obj13 obj0)
   goals met: 0 of 8
15. (load obj9 obj13 obj0)
   deleted: (at obj13 obj0)
   added: (in obj13 obj9)
   goals met: 0 of 8
16. (unload obj7 obj12 obj0)
   deleted: (in obj12 obj7)
   added: (at obj12 obj0)
   goals met: 0 of 8
17. (load obj9 obj12 obj0)
   deleted: (at obj12 obj0)
   added: (in obj12 obj9)
   goals met: 0 of 8
18. (unload obj7 obj11 obj0)
   deleted: (in obj11 obj7)
   added: (at obj11 obj0)
   goals met: 0 of 8
19. (load obj9 obj11 obj0)
   deleted: (at obj11 obj0)
   added: (in obj11 obj9)
   goals met: 0 of 8
20. (load obj7 obj10 obj0)
   deleted: (at obj10 obj0)
   added: (in obj10 obj7)
   goals met: 0 of 8
21. (drive obj7 obj0 obj6)
   deleted: (at obj7 obj0)
   added: (at obj7 obj6)
   goals met: 0 of 8
22. (unload obj7 obj10 obj6)
   deleted: (in obj10 obj7)
   added: (at obj10 obj6)
   goals met: 1 of 8
23. (fly obj9 obj0 obj2)
   deleted: (at obj9 obj0)
   added: (at obj9 obj2)
   goals met: 1 of 8
24. (unload obj9 obj8 obj2)
   deleted: (in obj8 obj9)
   added: (at obj8 obj2)
   goals met: 2 of 8
25. (unload obj9 obj16 obj2)
   deleted: (in obj16 obj9)
   added: (at obj16 obj2)
   goals met: 3 of 8
26. (unload obj9 obj15 obj2)
   deleted: (in obj15 obj9)
   added: (at obj15 obj2)
   goals met: 4 of 8
27. (load obj9 obj14 obj2)
   deleted: (at obj14 obj2)
   added: (in obj14 obj9)
   goals met: 4 of 8
28. (unload obj9 obj13 obj2)
   deleted: (in obj13 obj9)
   added: (at obj13 obj2)
   goals met: 5 of 8
29. (unload obj9 obj12 obj2)
   deleted: (in obj12 obj9)
   added: (at obj12 obj2)
   goals met: 6 of 8
30. (unload obj9 obj11 obj2)
   deleted: (in obj11 obj9)
   added: (at obj11 obj2)
   goals met: 7 of 8
31. (fly obj9 obj2 obj0)
   deleted: (at obj9 obj2)
   added: (at obj9 obj0)
   goals met: 7 of 8
32. (unload obj9 obj14 obj0)
   deleted: (in obj14 obj9)
   added: (at obj14 obj0)
   goals met: 8 of 8
